Computing network status...

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
tf_op_layer_tf_op_layer_true (None, 32, 32, 3)         0         
_________________________________________________________________
tf_op_layer_tf_op_layer_sub  (None, 32, 32, 3)         0         
_________________________________________________________________
vgg19 (Model)                (None, 1, 1, 512)         20024384  
_________________________________________________________________
global_average_pooling2d (Gl (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 100)               51300     
=================================================================

+---------------------------------------------------------------+
|                    Neutrino Model Profiler                    |
+-----------------------------------------+---------------------+
|             Param Name (Original Model) |                Value|
|                      Backend: TFBackend |                     |
+-----------------------------------------+---------------------+
|                   Evaluation Metric (%) |               1.0000|
|                         Model Size (MB) |              76.5827|
|     Computational Complexity (GigaMACs) |               0.4185|
|             Total Parameters (Millions) |              20.0757|
|                   Memory Footprint (MB) |              76.6358|
|                     Execution Time (ms) |               3.1892|
+-----------------------------------------+---------------------+
